{
  "backend/cryptoHolding.mo": "Defines a CryptoHolding record with id, symbol, amount, invested GBP, and current GBP value.",
  "backend/livePortfolioSnapshot.mo": "Defines a LivePortfolioSnapshot with timestamp and total GBP value.",
  "backend/main.mo": "Main actor managing user profiles, holdings, rewards, portfolio history, and snapshots with access control.",
  "backend/portfolioHistoryRecord.mo": "Defines a portfolio history record with timestamp, total value, and total invested GBP.",
  "backend/portfolioMetrics.mo": "Defines portfolio metrics including total value, gain/loss, and percentage change.",
  "backend/stakingReward.mo": "Defines a staking reward with id, symbol, amount, and reward date.",
  "backend/timeRange.mo": "Defines time range variants for filtering portfolio data.",
  "backend/userProfile.mo": "Defines a simple user profile containing a name.",
  "feature_evidence.json": "Feature evidence describing removal of the staking rewards tab from the dashboard.",
  "frontend-file-summaries.txt": "Contains summaries of all frontend files and their purposes.",
  "frontend/index.css": "Tailwind-based global styles defining light and dark theme variables.",
  "frontend/index.html": "Base HTML file mounting the React app.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile setup, and dashboard rendering.",
  "frontend/src/components/AddHoldingDialog.tsx": "Dialog for adding a crypto holding with symbol suggestions and invested amount input.",
  "frontend/src/components/AddStakingRewardDialog.tsx": "Dialog for adding staking rewards with inputs for symbol, amount, and reward date.",
  "frontend/src/components/EditHoldingDialog.tsx": "Dialog component allowing users to edit an existing crypto holding with validation and update mutation.",
  "frontend/src/components/EditStakingRewardDialog.tsx": "Dialog for editing staking reward details including amount, symbol, and reward date with update mutation.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying attribution with a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with authentication controls, theme toggle, and user greeting based on Internet Identity.",
  "frontend/src/components/HoldingsManager.tsx": "Manages and displays crypto holdings with sorting, dialogs for CRUD operations, and performance views driven by price data.",
  "frontend/src/components/IncrementHoldingDialog.tsx": "Dialog enabling users to add additional investment to a holding by calculating new totals using live price data.",
  "frontend/src/components/IndividualCryptoPerformance.tsx": "Displays performance metrics and generated chart data for a specific cryptocurrency using holdings, rewards, and price info.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a login screen with Internet Identity login and feature highlights.",
  "frontend/src/components/PortfolioChart.tsx": "Generates historical portfolio value data and renders it as a line chart using holdings, rewards, prices, and time range.",
  "frontend/src/components/PortfolioCompositionChart.tsx": "Builds a pie chart showing portfolio composition by asset value, including staking rewards.",
  "frontend/src/components/PortfolioOverview.tsx": "Calculates total portfolio metrics and per‑asset summaries, rendering an overview with price-based valuations.",
  "frontend/src/components/PortfolioPerformanceChart.tsx": "Renders live and historical portfolio performance using area charts with sliding-window live updates.",
  "frontend/src/components/ProfileSetupModal.tsx": "Provides a form to create a user profile by submitting a name to the backend.",
  "frontend/src/components/StakingRewardsManager.tsx": "UI component to list, add, edit, and delete staking rewards with price lookup and dialogs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useCryptoPrices.ts": "Fetches crypto prices using CoinGecko and Revolut mappings with validation for symbols and API responses.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login, logout, and identity persistence through a React context provider.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, holdings, and staking rewards via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles with light/dark theme variables, gradients, and animation utilities.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard page with portfolio overview and holdings management components.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store them in sessionStorage, and retrieve or clear persisted values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, shadows, plugins, and content paths using OKLCH variable-driven theming.",
  "project_state.json": "Stores project metadata, feature states, and a pending request to remove the staking rewards tab from the UI."
}